// Здесь выбираем админку.
// Если какая-то не используется - просто закоментируйте одну из строк.
// ТОЛЬКО ОДНУ ВЫБИРАТЬ, ПОТОМУ ЧТО ВМЕСТЕ ОНИ НЕ МОГУТ РАБОТАТЬ!!!!!!!!!!!!!!!!!!!!!!

//#define BestPDA_COT     // Если Админка - COT
#define BestPDA_VPP   // Если Админка - VPP

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Если объявлен - отключить сбор статистики

//#define BESTPDA_STATS_OFF

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Если объявлен - отключить заметки

//#define BESTPDA_NOTES_OFF

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Если объявлен - отключить глобальный ванильный чат (сделать обратное условие)

//#define BESTPDA_CHAT

///////////////////////////////////////////////////////////////////////////////////////////////////////

// Если объявлен - отключить респавн членов гп на базе ГП
// При использовании - подключить серверный мод BestPDA_SpawnFixServer

//#define BestPDA_RespawnGP_OFF

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Если объявлен - отключить переодевание в гп шмот у членов ГП
// При использовании - подключить серверный мод BestPDA_SpawnFixServer

//#define BestPDA_ReWearingGP_OFF

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Если объявлен - включить логи на клиенте [Число для логов, по которым я ищу ошибки]

//#define BestPDA_DoLogs 

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Использовать ли предмет ПДА, как обязательный для использования функционала

#define BestPDA_USE_MAIN__ITEM

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Выключить ли у Группировок отношения - если не нужно - раскоментировать

#define BESTPDA_GP_RELATION_OFF

///////////////////////////////////////////////////////////////////////////////////////////////////////

// Включить ли транслирование чата ПДА в общий глобальный чат
// (Игрок отправил сообщение, а оно в ванильный дейз чат пришло в том же виде)
// Идеально для тех, кто объявил BESTPDA_CHAT

//#define BESTPDA_TRANSLATE_GLOBAL_CHAT 

///////////////////////////////////////////////////////////////////////////////////////////////////////

// Отключает 3D метки участников группы/группировки (которые на экране игрока)
//#define BESTPDA_HiddenMembers_3D

// Отключает список членов группы/группировки (слева сверху на экране)
//#define BESTPDA_HiddenMembers_List

// Отключает в принципе ВСЕ 3D метки (которые на экране игрока)
//#define BESTPDA_HiddenMarks_3D

///////////////////////////////////////////////////////////////////////////////////////////////////////

// Если объявлен - открытие формы ПДА только если ПДА в руках
//#define BestPDA_ONLY_WITH_HANDS